Repository: MetaModels/core
Catalog: src/CoreBundle/Resources/translations/*_metamodel_searchable_pages.*.xlf
Languages: de

# backend-module.headline
source: All search settings
de: Alle Indexierungen

# new.label
source: New index
de: Neuer Index

# new.description
source: Create a new searchable page setting
de: Erstellen einer neuen Indexierung.

# all.label
source: Edit multiple
de: Mehrere bearbeiten

# all.description
source: Edit multiple elements at once
de: Mehrere Elemente auf einmal bearbeiten

# pastenew.label
source: Create a new element at the top
de: Ein neues Element oben erstellen

# pastenew.description
source: Create a new element after element ID %id%
de: Erstellt ein neues Element nach dem Element mit der ID %id%

# pasteafter.label
source: Paste at the top
de: Oben einfügen

# pasteafter.description
source: Paste after element ID %id%
de: Nach dem Element mit der ID %id% einfügen

# backBT
source: Go back
de: Zurück

# backBTTitle
source: Back to the previous page
de: Zurück zur vorherigen Seite navigieren

# showRecord
source: Show the details of record %id%
de: Zeige die Details der Einstellungen für die Indexierung ID %id% an.

# name.description
source: Name of the searchable page setting
de: Name der Einstellungen für die Indexierung

# tstamp.label
source: Revision date
de: Aktualisierungsdatum

# tstamp.description
source: Date and time of the latest revision.
de: Datum und Zeit der letzten Aktualisierung

# rendersetting.label
source: Rendersetting
de: Render-Einstellung

# rendersetting.description
source: Choose the rendersetting which will be used for the search rendering.
de: Wähle die Render-Einstellung, die bei der Indexierung verwendet werden soll. Meistens ist es sinnvoll, die Render-Einstellung für die Listenansicht zu benutzen.

# filter.label
source: Filtersetting
de: Filtereinstellungen

# filter.description
source: Choose the filtersetting which will be used for the search rendering.
de: Wähle das Filterset aus, welches bei der Indexierung verwendet werden soll. Eine Filterung ist nur dann notwendig, wenn bestimmte Seiten von der Indexierung ausgeschlossen werden sollen.

# filterparams.label
source: Filter parameter override
de: Filterparameter überschreiben

# filterparams.description
source: Filter parameter override
de: Filterparameter überschreiben

# general_legend
source: General settings
de: Grundeinstellungen

# edit.label
source: Edit searchable page
de: Indexierung bearbeiten

# edit.description
source: Edit the searchable page setting ID %id%
de: Indexierung ID %id% bearbeiten.

# copy.label
source: Copy searchable page
de: Kopieren der Indexierung

# copy.description
source: Copy definition of searchable page setting ID %id%
de: Kopieren der Definition der Indexierung ID %id%

# delete.label
source: Delete searchable page
de: Indexierung löschen

# delete.description
source: Delete searchable page setting ID %id%
de: Löschen der Indexierung ID %id%

# delete.confirm
source: Do you really want to delete element ID %id%?
de: Wollen Sie wirklich die Einstellung mit der ID %id% löschen?

# show.label
source: Searchable page setting details
de: Details der Einstellungen der Indexierung

# show.description
source: Show details of searchable page setting ID %id%
de: Zeigen Sie die Details der Einstellungen für die Indexierung ID %id% an.

# toggle.label
source: Toggle
de: Wechseln

# toggle.description
source: Toggle the state of searchable page setting ID %id%
de: Wechseln des Status für die Einstellungen ID %id%

# settings.label
source: Searchable page settings
de: Einstellungen der Indexierung

# settings.description
source: Edit the settings of searchable page setting ID %id%
de: Bearbeiten der Einstellungen der Indexierung ID %id%

# published.label
source: Searchable page settings
de: Einstellungen Indexierung

# published.description
source: Published
de: Veröffentlicht

# deleteConfirm
source: Do you really want to render setting ID %id%?
de: Wollen Sie die Einstellung ID %id% wirklich rendern?

# closeAll.label
source: Cancel
de: Abbrechen

# closeAll.description
source: Cancel multiple processing.
de: Mehrfachbearbeitung abbrechen
