Repository: MetaModels/core
Catalog: src/CoreBundle/Resources/translations/*_metamodel_dca_combine.*.xlf
Languages: de

# backend-module.headline
source: All input/output combinations
de: Alle Kombinationen der Eingabemaske und Ansichten

source: Save
de: Speichern

# saveNclose
source: Save and close
de: Speichern und schliessen

# saveNcreate
source: Save and new
de: Speichern und neu

# saveNback
source: Save and go back
de: Speichern und zurück

# backBT
source: Go back
de: Zurück

# backBTTitle
source: Back to the previous page
de: Zurück zur vorherigen Seite navigieren

# editRecord
source: Edit record %id%
de: Datensatz %id% bearbeiten

# dca_combiner_legend
source: Combination configuration
de: Konfiguration der Kombination

# dca_combiner.label
source: Permissions for input screen and views
de: Rechte für Eingabemaske und Ansichten

# dca_combiner.description
source: For selected frontend user group (if any) and selected backend user group (if any) use the selected palette and the selected view.
de: Benutzen Sie die ausgewählte Palette und Ansicht für eine Mitglieder- und / oder Benutzergruppe (falls vorhanden).

# fe_group.label
source: Frontend group
de: Mitgliedergruppe

# fe_group.description
source: The frontend user group the combination applies to; * is 'catch all'.
de: Die Mitgliedergruppe, für die die Kombination gilt; * ist "catch all".

# be_group.label
source: Backend group
de: Benutzergruppe

# be_group.description
source: The backend user group the combination applies to; * is 'catch all'.
de: Die Benutzergruppe, für die die Kombination gilt; * ist "catch all".

# dca_id.label
source: Input screen
de: Eingabemaske

# dca_id.description
source: The input screen the combination applies to.
de: Geben Sie die Eingabemaske an, für die diese Kombination gelten soll.

# view_id.label
source: Render setting
de: Render-Einstellung

# view_id.description
source: The view the combination applies to.
de: Anzuwendende Ansicht.

source: Anonymous
de: "Gäste"
