Repository: MetaModels/core
Catalog: src/CoreBundle/Resources/translations/*_metamodel_item.*.xlf
Languages: de, fr

# new.label
source: New item
de: Neuer Datensatz
fr: Nouvel élément

# new.description
source: Create new item
de: Neuer Datensatz erstellen
fr: Créer un nouvel élément

# edit.label
source: Edit item
de: Item bearbeiten
fr: Modifier l'élément

# edit.description
source: Edit item ID %id%
de: Bearbeite Datensatz %id%
fr: Modifier l'ID de l'élément %id%

# editAll.label
source: Edit multiple
de: Mehrere bearbeiten

# editAll.description
source: Edit multiple
de: Mehrere bearbeiten

# metamodel_edit_as_child.label
source: Edit "%child_name%"
de: "%child_name%" berabeiten

# metamodel_edit_as_child.description
source: Edit "%child_name%" for item %id%
de: "%child_name%" für Datensatz %id% bearbeiten
fr: Modifier « %child_name% » pour l'élément %id%

# copy.label
source: Copy item
de: Datensatz kopieren
fr: Copier l'élément

# copy.description
source: Copy item ID %id%
de: Datensatz ID %id% kopieren
fr: Copier l'ID de l'élément %id%

# createvariant.label
source: New variant
de: Neue Variante

# createvariant.description
source: Create a new variant of item ID %id%
de: Erstellt eine neue Variante von Datensatz ID %id%
fr: Créer une nouvelle variante de l'élément ID %id%

# cut.label
source: Move item
de: Datensatz verschieben
fr: Déplacer l'élément

# cut.description
source: Move item ID %id%
de: Datensatz ID %id% verschieben
fr: Déplacer l'élément ID %id%

# delete.label
source: Delete item
de: Datensatz löschen
fr: Supprimer l'élément

# delete.description
source: Delete item ID %id%
de: Datensatz ID %id% löschen
fr: Supprimer l'élément ID %id%

# delete.confirm
source: Do you really want to delete element ID %id%?
de: Soll das Element ID %id% wirklich gelöscht werden?

# show.label
source: Item details
de: Datensatz-Details
fr: Détails de l'élément

# show.description
source: Show details of item ID %id%
de: Die Details des Datensatz ID %id% anzeigen
fr: Afficher les détails de l'élément ID %id%

# editheader.label
source: Edit item type
de: Datensatz-Typ bearbeiten
fr: Modifier le type d'élément

# editheader.description
source: Edit the item type
de: Bearbeiten Sie den Datensatz-Typ
fr: Modifier le type d'élément

# pasteafter.label
source: Create new item
de: Neuen Datensatz erstellen
fr: Créer un nouvel élément

# pasteafter.description
source: Create a new item after item ID %id%
de: Erstellt ein neuen Datensatz nach dem Datensatz mit der ID %id%
fr: Créer un nouvel élément aprés l'élément ID %id%

# pasteinto.label
source: Create new item
de: Neuen Datensatz erstellen
fr: Créer un nouvel élément

# pasteinto.description
source: Create a new item in item ID %id%
de: Erstellt ein neuen Datensatz nach dem Datensatz mit der ID %id%
fr: Créer un nouvel élément dans l'élément ID %id%

# pastenew.label
source: Add new at the top
de: Oben einfügen

# pastenew.description
source: Add new item after item ID %id%
de: Erstellt ein neuen Datensatz nach Datensatz mit der ID %id%
fr: Ajouter un nouvel élément après l'élément ID %id%

# varbase.label
source: Is variant base
de: Basis für Varianten

# varbase.description
source: Check this if you want to make this the base for the current variant group
de: Aktivieren wenn dies die Basis für die aktuelle Gruppe an Varianten sein soill

# editRecord
source: Edit item %id%
de: Bearbeite Datensatz %id%
fr: Modifier l'élément %id%

# newRecord
source: Create a new item
de: Neuen Datensatz erstellen
fr: Créer un nouvel élément

# sorting.label
source: Sorting
de: Sortierung

# sorting.description
source: The manual sorting
de: Manuelle Sortierung

# id.label
source: ID of the item
de: ID des Datensatzes
fr: ID de l'élément

# id.description
source: The id of the item
de: ID des Datensatzes
fr: ID de l'élément

# pid.label
source: Parent item id
de: Eltern-ID
fr: ID de l'élément parent

# pid.description
source: The id of the parent item
de: Die ID des Eltern-Datensatzes
fr: ID de l'élément parent

# tstamp.label
source: Revision date
de: Aktualisierungsdatum

# tstamp.description
source: The date when the item revision was created
de: Aktualisierungsdatum
fr: Date de création de la révision de l'élément

# showRecord
source: Show the details of record %id%
de: Die Details des Datensatzes %id% anzeigen

# backBT
source: Go back
de: Zurück

# backBTTitle
source: Back to the previous page
de: Zurück zur vorherigen Seite navigieren

source: Save
de: Speichern
fr: Sauvegarder

# saveNclose
source: Save and close
de: Speichern und schliessen
fr: Sauvegarder et fermer

# saveNcreate
source: Save and new
de: Speichern und Neu
fr: Sauvegarder et nouveau

# saveNback
source: Save and go back
de: Speichern und zurück
fr: Sauvegarder et retour
