Repository: MetaModels/core
Catalog: src/CoreBundle/Resources/translations/*_metamodel_filtersetting.*.xlf
Languages: de

# backend-module.headline
source: All filter settings
de: Alle Filtereinstellungen

# sorting.label
source: Sorting
de: Sortierung

# tstamp.label
source: Revision date
de: Aktualisierungsdatum

# new.label
source: New filter setting
de: Neue Filtereinstellung

# new.description
source: Create a new filter setting
de: Eine neue Filtereinstellung erstellen

# all.label
source: Edit multiple
de: Mehrere bearbeiten

# all.description
source: Edit multiple elements at once
de: Mehrere Elemente auf einmal bearbeiten

# pastenew.label
source: Create a new element at the top
de: Ein neues Element oben erstellen

# pastenew.description
source: Create a new element after element ID %id%
de: Erstellt ein neues Element nach dem Element mit der ID %id%

# pasteafter.label
source: Paste at the top
de: Oben einfügen

# pasteafter.description
source: Paste after element ID %id%
de: Nach dem Element mit der ID %id% einfügen

# pasteinto.label
source: Create new setting at the top
de: Neue Einstellung oben anlegen.

# pasteinto.description
source: Create new into setting ID %id%
de: Neue Einstellung nach Element ID %id% anlegen.

# backBT
source: Go back
de: Zurück

# backBTTitle
source: Back to the previous page
de: Zurück zur vorherigen Seite navigieren

# list_label.label
source: Filter settings
de: Filtereinstellungen

# fid.label
source: Parent collection
de: Aus übergeordnetem Element

# fid.description
source: The collection of filter settings, this setting belongs to.
de: Filtereinstellung(en), zu denen diese Einstellungen gehören.

# type.label
source: Type
de: Typ

# type.description
source: The type of this setting.
de: Geben Sie den Typ dieser Einstellung an.

# enabled.label
source: Enabled
de: Aktiviert

# enabled.description
source: Enable this filter setting.
de: Filtereinstellung aktivieren

# comment.label
source: Comment
de: Kommentar

# comment.description
source: A short comment for describing the purpose of this filter setting.
de: Ein kurzer Kommentar, der den Zweck dieser Filtereinstellung beschreibt.

# attr_id.label
source: Attribute
de: Attibut

# attr_id.description
source: Attribute this setting relates to.
de: Attribut, auf das sich diese Einstellung bezieht.

# all_langs.label
source: Search all languages
de: Alle Sprachen durchsuchen

# all_langs.description
source: Check if you want to perform the lookup language independant. If this is not checked, only the current active language will be searched.
de: Auswählen, um die Suche sprachunabhängig auszuführen. Falls nicht aktiviert wird nur die aktuelle Sprache in die Suche mit einbezogen.

# allow_empty.label
source: Allow empty value
de: Leeren Wert erlauben

# allow_empty.description
source: Check if you want to allow this filter value to be emtpy, if checked and the parameter holds an empty value, this filter rule will behave as if it was not defined.
de: Auswählen, wenn der Filterwert leer sein darf. Falls diese Option angewählt ist und der Parameter einen leeren Wert enthält, dann verhält sich dieser Filter so, als wäre er nicht definiert.

# stop_after_match.label
source: Stop after first match
de: Nach erstem Treffer beenden

# stop_after_match.description
source: Check if you want this filter setting to stop executing its child rules after the first subset returned matches.
de: Anwählen, falls Sie möchten, dass nachfolgende Regeln nach dem ersten Treffer nicht mehr ausgeführt werden.

# urlparam.description
source: The URL parameter that shall get mapped to the selected attribute. The special <em>"auto_item"</em> parameter can also be used, this is especially useful for alias columns.
de: Geben Sie den URL-Parameter an, der dem ausgewählten Attribut zugeordnet werden soll. Der <em>"auto_item"</em>-Parameter kann ebenfalls verwendet werden. Diese Einstellung ist nützlich um Aliase zu verwenden.

# predef_param.label
source: Static parameter
de: Statischer Parameter

# predef_param.description
source: Check if you want to be able to set the value of this parameter in the parenting list (modules, content elements, etc.).
de: Auswählen, wenn Sie Werte für diesen Parameter aus einer übergeordneten Liste (wie zum Beispiel Module, Inhaltselemente, etc.) beziehen möchten.

# fe_widget.label
source: Provide Frontend widget
de: Frontend-Widget erzeugen

# fe_widget.description
source: Check if you want to display a filter widget in the Frontend.
de: Auswählen, falls ein Filter-Widget im Frontend angezeigt werden soll.

# customsql.label
source: Custom SQL Query
de: Eigene SQL-Abfrage

# customsql.description
source: The SQL query that shall be executed, insert tags are supported.
de: Auszuführende SQL-Abfrage. Insert-Tags werden unterstützt.

# label.description
source: Show label instead of attribute name.
de: Das Label wird anstelle des Attributnamens angezeigt.

# template.description
source: Sub template for this filter element. Standard: form widget.
de: Sub-Template für dieses Filterelement. Standard ist das FormWidget.

# blankoption.label
source: Empty option
de: Leere Auswahl ermöglichen

# blankoption.description
source: Show empty options in filter widget.
de: Leere Auswahloption im Filterwidget ermöglichen.

# onlyused.label
source: Assigned values only
de: Nur zugeordnete Werte

# onlyused.description
source: Show only options, that are assigned somewhere in the MetaModel.
de: Zeige nur die Werte, die im MetaModel bereits zugeordnet sind.

# onlypossible.label
source: Remaining values only
de: Nur verbleibende Werte

# onlypossible.description
source: Show only options, that are still assigned somewhere after the actual filter is set.
de: Zeige nur die Werte, für die es nach Anwendung dieses Filters ein Ergebnis gibt.

# skipfilteroptions.label
source: Ignore this filter for the remaining values
de: Diesen Filter für verbleibende Werte ignorieren

# skipfilteroptions.description
source: If activate the filter will return all options without itself in the filter rules.
de: Falls aktiviert, wird dieser Filter alle Werte außer seine eigenen zurück liefern.

# hide_label.label
source: Hide label in filter widget
de: Label verbergen

# hide_label.description
source: If active, the label is not output.
de: Falls aktiviert wird das Label nicht im Frontend ausgegeben.

# label_as_blankoption.label
source: Use label as blank option
de: Label als leere Option nutzen

# label_as_blankoption.description
source: If active, the label output as blank option.
de: Falls aktiviert wird das Label als leere Option im Frontend ausgegeben.

# apply_sorting.label
source: Sorting
de: Sortierung

# apply_sorting.description
source: Please enter sorting of values in filter widget.
de: Sortierung der Werte im Filterwidget wählen.

# cssID.label
source: CSS ID/class
de: CSS Id / Klasse

# cssID.description
source: Here you can set an ID and one or more classes.
de: Hier können Sie die CSS-Klasse oder ID setzen.

# placeholder.label
source: Placeholder
de: Platzhalter

# placeholder.description
source: Show this text as long as the field is empty.
de: Diesen Text anzeigen solange das Fekld leer ist.

# use_only_in_env.label
source: Use SQL only in environment
de: SQL Verwendung einschränken

# use_only_in_env.description
source: If active, the SQL is only executed in the selected environment - e.g. for example only in the backend.
de: Wenn aktiv, wird das SQL nur in der ausgewählten Umgebung ausgeführt - also z. B. nur im Backend.

# use_only_in_env.only_backend
source: Only in backend
de: Nur im Backend

# use_only_in_env.only_frontend
source: Only in frontend
de: Nur im Frontend

# sorting_directions.natsort_asc
source: Natural sorting (ASC)
de: Natürliche Sortierung (aufsteigend)

# sorting_directions.natsort_desc
source: Natural sorting (DESC)
de: Natürliche Sortierung (absteigend)

# defaultid.label
source: Default
de: Standard

# defaultid.description
source: Default value for selection.
de: Standardwert für die Auswahl festlegen

# title_legend
source: Type
de: Typ

# config_legend
source: Configuration
de: Konfiguration

# edit.label
source: Edit setting
de: Einstellung bearbeiten

# edit.description
source: Edit the filter setting ID %id%
de: Die Filtereinstellung ID %id% bearbeiten

# copy.label
source: Copy filter setting definition
de: Filtereinstellung kopieren

# copy.description
source: Copy the filter setting ID %id%
de: Kopieren Sie die Filtereinstellung ID %id%

# cut.label
source: Cut filter setting definition
de: Filtereinstellungen ausschneiden

# cut.description
source: Cut the filter setting ID %id%
de: Filtereinstellungen ID %id% ausschneiden.

# delete.label
source: Delete filter setting
de: Filtereinstellung löschen

# delete.description
source: Delete the filter setting ID %id%
de: Die Filtereinstellung Id %id% löschen

# delete.confirm
source: Do you really want to delete element ID %id%?
de: Soll das Element ID %id% wirklich gelöscht werden?

# show.label
source: Filter setting details
de: Details der Filtereinstellungen

# show.description
source: Show details of filter setting ID %id%
de: Die Details der Filtereinstellung ID %id% anzeigen

# toggle.label
source: Toggle
de: Wechseln

# toggle.description
source: Toggle the state of setting ID %id%
de: Wechseln des Status der Einstellung ID %id%

# typenames.idlist
source: Predefined set of items
de: Vordefinierter Satz von Items

# typenames.simplelookup
source: Simple lookup
de: Einfache Abfrage

# typenames.customsql
source: Custom SQL
de: Eigenes SQL

# typenames.conditionor
source: OR condition
de: ODER-Bedingung

# typenames.conditionand
source: AND condition
de: UND-Bedingung

# items.description
source: Please enter the IDs of the items for filtering as comma-separated list.
de: Bitte geben Sie für die Filterung die IDs der Items als Komma-Separierte-Liste ein.

# deleteConfirm
source: Do you really want to delete filter setting ID %id%?
de: Soll die Filtereinstellung ID %id% wirklich gelöscht werden?

# closeAll.label
source: Cancel
de: Abbrechen

# closeAll.description
source: Cancel multiple processing.
de: Mehrfachbearbeitung abbrechen

# editRecord
source: Edit record %id%
de: Datensatz %id% bearbeiten

source: Save
de: Speichern

# saveNclose
source: Save and close
de: Speichern und schliessen

# saveNcreate
source: Save and new
de: Speichern und neu

# saveNback
source: Save and go back
de: Speichern und zurück
