Repository: MetaModels/core
Catalog: src/CoreBundle/Resources/translations/*_metamodel_dca.*.xlf
Languages: de

# backend-module.headline
source: All input screens
de: Alle Eingabemasken

# sorting.label
source: Sorting
de: Sortierung

# new.label
source: New input screen
de: Neue Eingabemaske

# new.description
source: Create a new input screen
de: Eine neue Eingabemaske erstellen

# all.label
source: Edit multiple
de: Mehrere bearbeiten

# all.description
source: Edit multiple elements at once
de: Mehrere Elemente auf einmal bearbeiten

# pastenew.label
source: Create a new element at the top
de: Ein neues Element oben erstellen

# pastenew.description
source: Create a new element after element ID %id%
de: Erstellt ein neues Element nach dem Element mit der ID%id%

# pasteafter.label
source: Paste at the top
de: Oben einfügen

# pasteafter.description
source: Paste after element ID %id%
de: Nach dem Element mit der ID %id% einfügen

source: Save
de: Speichern

# saveNclose
source: Save and close
de: Speichern und schliessen

# saveNcreate
source: Save and new
de: Speichern und neu

# saveNback
source: Save and go back
de: Speichern und zurück

# backBT
source: Go back
de: Zurück

# backBTTitle
source: Back to the previous page
de: Zurück zur vorherigen Seite navigieren

# showRecord
source: Show the details of record %id%
de: Die Details des Datensatzes %id% anzeigen

# editRecord
source: Edit record %id%
de: Datensatz %id% bearbeiten

# editheader.label
source: Edit MetaModel
de: MetaModel bearbeiten

# editheader.description
source: Edit the MetaModel ID %id%
de: Das MetaModel mit der ID %id% bearbeiten.

# name.description
source: Name of the input screen.
de: Name der Eingabemaske

# tstamp.label
source: Revision date
de: Aktualisierungsdatum

# tstamp.description
source: Date and time of the latest revision.
de: Datum und Zeit der letzten Aktualisierung

# rendertype.description
source: Select the desired type of integration.
de: Die gewünschte Art der Integration auswählen

# rendermode.label
source: Render mode
de: Render-Modus

# rendermode.description
source: Select the desired render mode.
de: Wählen Sie eine gewünschte Render-Einstellung aus.

# ptable.label
source: Parent table name
de: Name der Elterntabelle

# ptable.description
source: Name of the database table that shall be referred to as parent table.
de: Name der Datenbanktabelle, die als Elterntabelle benutzt werden soll.

# showColumns.label
source: Use column based layout
de: Anzeige in Tabellenform

# showColumns.description
source: If selected a table header will be generated with column names.
de: Ist die Option ausgewählt, erfolgt die Anzeige in Form einer Tabelle.

# backendsection.label
source: Backend section
de: Backend-Bereich

# backendsection.description
source: Select the desired backend section where you want the MetaModel appear. For models that shall be edited by end users, the "content" section most likely will be appropriate.
de: Wählen Sie das gewünschte Backend-Symbol, das zum Zeichnen eines Icons in der übergeordneten Liste verwendet wird, wenn Sie eine Integration als Kindtabelle haben.

# backendicon.description
source: Select the desired backend icon.This icon will get used to draw an image in the parent list if you have a integration as child table.
de: Wählen Sie das gewünschte Backend-Symbol, das zum Zeichnen eines Icons in der übergeordneten Liste verwendet wird, wenn Sie eine Integration als Kindtabelle haben.

# backendcaption.label
source: Backend caption
de: Backend-Hilfetext

# backendcaption.description
source: The text you specify in here, will get used as the label and description text in the backend menu.
de: Dieser Text wird als Label und Beschreibung im Backend benutzt.

# becap_langcode.label
source: Language
de: Sprache

# becap_langcode.description
source: Select the languages you want to provide.
de: Wählen Sie die Sprachen aus, die Sie zur Verfügung stellen wollen.

# becap_label.description
source: The text you specify in here, will get used as the menu label in the backend menu.
de: Dieser Text wird als Menü-Label im Backend benutzt.

# becap_description.label
source: Description text
de: Beschreibungstext

# becap_description.description
source: The text you specify in here, will get used as the description (hover title) in the backend menu.
de: Dieser Text wird als Beschreibung (Hover) im Backend benutzt.

# panelLayout.description
source: Separate panel options with comma (= space) and semicolon (= new line) like "filter;search;sort,limit".
de: Fügen Sie eine oder mehrere Panel-Optionen hinzu und trennen Sie diese mit einem Komma (= Freiraum) oder Semikolon (= neue Zeile), z. B. "filter;search;sort,limit".

# use_limitview.label
source: View limitation
de: Limitierung anzeigen

# use_limitview.description
source: Activate the view limitation.
de: Die Limitierungsansicht aktivieren.

# limit_rendersetting.label
source: Limit the render setting
de: Rendering-Einstellung begrenzen

# limit_rendersetting.description
source: Choose between front end or backend.
de: Wählen Sie zwischen Frontend und Backend aus.

# iseditable.label
source: Allow editing of items
de: Bearbeitung erlauben

# iseditable.description
source: If checked, this input screen allows the editing of items.
de: Falls ausgewählt erlaubt die Eingabemaske das Bearbeiten der Items.

# iscreatable.label
source: Allow creating of items
de: Erstellung erlauben

# iscreatable.description
source: If checked, this input screen allows the creating of items.
de: Falls ausgewählt erlaubt die Eingabemaske das Erstellen von Items.

# isdeleteable.label
source: Allow deleting of items
de: Löschung erlauben

# isdeleteable.description
source: If checked, this input screen allows the deleting of items.
de: Falls ausgewählt erlaubt die Eingabemaske das Löschen von Items.

# view_legend
source: View settings
de: Darstellungsoptionen

# display_legend
source: Data display settings
de: Anzeigeeinstellungen

# permissions_legend
source: Data manipulation permissions
de: Berechtigungen zur Datenanpassung

# edit.label
source: Edit input screen
de: Eingabemasken bearbeiten

# edit.description
source: Edit the input screen ID %id%
de: Die Eingabemaske ID %id% bearbeiten

# copy.label
source: Copy input screen definition
de: Eingabemaske kopieren

# copy.description
source: Copy definition of input screen ID %id%
de: Kopieren Sie die Definition der Eingabemaske ID %id%.

# delete.label
source: Delete input screen
de: Eingabemaske löschen

# delete.description
source: Delete input screen ID %id%
de: Die Eingabemaske ID %id% löschen

# delete.confirm
source: Do you really want to delete element ID %id%?
de: Soll das Element ID %id% wirklich gelöscht werden?

# show.label
source: Input screen details
de: Eingabemasken-Details

# show.description
source: Show details of input screen ID %id%
de: Die Details der Eingabemaske ID %id% anzeigen

# settings.label
source: Input screen settings
de: Eingabemasken-Einstellungen

# settings.description
source: Edit the settings of input screen ID %id%
de: Bearbeiten Sie die anzuzeigenden Felder der Eingabemaske ID %id%.

# groupsort_settings.label
source: Grouping and sorting
de: Gruppieren und sortieren

# groupsort_settings.description
source: Edit the grouping and sorting settings of input screen ID %id%
de: Bearbeiten Sie die Gruppierung und Sortierung der Eingabemaske ID %id%.

# subheadline.label
source: Additions to the mask-heading
de: Ergänzungen zur Maskenüberschrift

# subheadline.description
source: The field can be used to adapt the heading of the mask at edit and replaces the output of the ID.You can use simple tokens e.g. ##model_name##, ##model_firstname## [##model_id##]
de: Das Feld kann verwendet werden, um die Überschrift der Maske bei der Bearbeitung anzupassen und ersetzt die Ausgabe der ID. Sie können einfache Token verwenden, z. B. ##model_name##, ##model_firstname## [##model_id##]

# rendertypes.standalone
source: Standalone
de: Unabhängig

# rendertypes.ctable
source: As child table
de: Als Kind-Tabelle

# rendermodes.flat
source: Flat
de: Eine Ebene (ohne Hierarchie)

# rendermodes.parented
source: Parented
de: Elternelement vorhanden

# rendermodes.hierarchical
source: Hierarchical
de: Hierarchie

# hint_rendermode_hierarchical
source: When using the "Hierarchical" render mode, the current sort must be enable to "Manual sorting" as default.
de: Wenn Sie den Rendering-Modus "Hierarchie" verwenden, muss die aktuelle Sortierung standardmäßig auf "Manuelle Sortierung" eingestellt sein.

# deleteConfirm
source: Do you really want to delete input screen ID %id%?
de: Soll die Eingabemaske ID %id% wirklich gelöscht werden?

# closeAll.label
source: Cancel
de: Abbrechen

# closeAll.description
source: Cancel multiple processing.
de: Mehrfachbearbeitung abbrechen

# panelLayout_headline
source: Add one or more panel options and separate with comma (= space) or semicolon (= new line) like "filter;search;sort,limit"
de: Fügen Sie eine oder mehrere Panel-Optionen hinzu und trennen Sie diese mit einem Komma (= Freiraum) oder Semikolon (= neue Zeile), z. B. "filter;search;sort,limit".

# panelLayout_filter.description
source: Show the filter records menu.
de: Zeige Filter in der Listendarstellung

# panelLayout_search.description
source: Show the search records menu.
de: Zeige Suche in der Listendarstellung

# panelLayout_sort.description
source: Show the sort records menu.
de: Zeige Sortierung in der Listendarstellung

# panelLayout_limit.description
source: Show the limit records menu.
de: Zeige Limit in der Listendarstellung
