Repository: MetaModels/core
Catalog: src/CoreBundle/Resources/translations/*_metamodel_dca_sortgroup.*.xlf
Languages: de

# backend-module.headline
source: All grouping and sorting settings
de: Einstellungen Gruppierung und Sortierung

# tstamp.label
source: Revision date
de: Aktualisierungsdatum

# sorting.label
source: Sorting
de: Sortierung

# published.label
source: Published
de: Veröffentlicht

# new.label
source: New Sorting and grouping
de: Neue Sortierung und Gruppierung

# new.description
source: Create a new Sorting and grouping
de: Erstellt eine Sortierung und Gruppierung.

# all.label
source: Edit multiple
de: Mehrere bearbeiten

# all.description
source: Edit multiple elements at once
de: Mehrere Elemente auf einmal bearbeiten

# pastenew.label
source: Create a new element at the top
de: Ein neues Element oben erstellen

# pastenew.description
source: Create a new element after element ID %id%
de: Erstellt ein neues Element nach dem Element mit der ID %id%

# pasteafter.label
source: Paste at the top
de: Oben einfügen

# pasteafter.description
source: Paste after element ID %id%
de: Nach dem Element mit der ID %id% einfügen

# backBT
source: Go back
de: Zurück

# backBTTitle
source: Back to the previous page
de: Zurück zur vorherigen Seite navigieren

source: Save
de: Speichern

# saveNclose
source: Save and close
de: Speichern und schliessen

# saveNcreate
source: Save and new
de: Speichern und Neu

# saveNback
source: Save and go back
de: Speichern und zurück

# editRecord
source: Edit record %id%
de: Datensatz %id% bearbeiten

# name.description
source: Name of the sorting group.
de: Name der Sortierungsruppe

# isdefault.label
source: Is default
de: Als Standard verwenden

# isdefault.description
source: Determines that this grouping and sorting shall be used as default for the MetaModel.
de: Bestimmt, dass diese Einstellung als Standard für das Eltern-MetaModel benutzt wird.

# rendermode.label
source: Render mode
de: Render-Modus

# rendermode.description
source: Select the desired render mode.
de: Wählen Sie eine gewünschte Render-Einstellung aus..

# becap_langcode.label
source: Language
de: Sprache

# becap_langcode.description
source: Select the languages you want to provide.
de: Wählen Sie die Sprachen aus, die Sie zur Verfügung stellen wollen.

# becap_label.description
source: The text you specify in here, will get used as the menu label in the backend menu.
de: Dieser Text wird als Menü-Label im Backend benutzt.

# becap_description.label
source: Description text
de: Beschreibungstext

# becap_description.description
source: The text you specify in here, will get used as the description (hover title) in the backend menu.
de: Dieser Text wird als Beschreibung (Hover) im Backend benutzt.

# rendergrouptype.label
source: Grouping type
de: Gruppierungstyp

# rendergrouptype.description
source: The grouping type to use in the item view.
de: Gruppierungstyp für die Item-Ansicht

# rendergroupattr.label
source: Grouping attribute
de: Attribute der Gruppierung

# rendergroupattr.description
source: The attribute to use for grouping in the item view.
de: Attribute für die Gruppierung in der Item-Ansicht.

# rendergrouplen.label
source: Grouping length
de: Gruppierungslänge

# rendergrouplen.description
source: The amount of characters to use for grouping.
de: Die Anzahl an Buchstaben, welche für die Gruppierung eingesetzt wird.

# rendersortattr.label
source: Sorting attribute
de: Attribut der Sortierung

# rendersortattr.description
source: The attribute to sort by.
de: Attribut nach dem sortiert wird.

# rendersort.label
source: Sorting direction
de: Sortierrichtung

# rendersort.description
source: The sorting direction.
de: Richtung der Sortierung.

# ismanualsort.label
source: Enable manual sorting
de: Manuelle Sortierung aktivieren

# ismanualsort.description
source: If this is enabled, the user will be able to perform manual sorting.
de: Wenn aktiviert, kann der Nutzer eine manuelle Sortierung vornehmen.

# display_legend
source: Data display settings
de: Anzeigeeinstellungen

# edit.label
source: Edit definition
de: Einstellung bearbeiten

# edit.description
source: Edit the definition ID %id%
de: Bearbeitung der Definition ID %id%.

# copy.label
source: Copy definition
de: Kopiere Definition

# copy.description
source: Copy the definition ID %id%
de: Kopieren Sie die Definition ID %id%.

# delete.label
source: Delete definition
de: Definition löschen

# delete.description
source: Delete the definition ID %id%
de: Löschen Sie die Definition ID %id%.

# delete.confirm
source: Do you really want to delete element ID %id%?
de: Soll das Element ID %id% wirklich gelöscht werden?

# show.label
source: Definition details
de: Details der Definition

# show.description
source: Show details of definition ID %id%
de: Zeige Details der Definition ID %id%.

# toggle.label
source: Toggle
de: Wechseln

# toggle.description
source: Toggle the state of definition ID %id%
de: Umschaltung des Status für die Definition ID %id%.

# settings.label
source: Definition settings
de: Einstellungen der Definition

# settings.description
source: Edit the settings of definition ID %id%
de: Bearbeiten Sie ein Einstellungen der Definition ID %id%.

# rendergrouptypes.none
source: Do not group
de: Nicht gruppieren

# rendergrouptypes.char
source: Group by initial letter(s)
de: Gruppiere nach Anfangsbuchstabe(n)

# rendergrouptypes.digit
source: Group by numeric order
de: Gruppiere nach Zahlen

# rendergrouptypes.day
source: Group by day of date
de: Gruppiere nach Tag des Datums

# rendergrouptypes.weekday
source: Group by weekday of date
de: Gruppiere nach Wochentag des Datums

# rendergrouptypes.week
source: Group by week of year
de: Gruppiere nach Woche des Jahres eines Datums

# rendergrouptypes.month
source: Group by month of date
de: Gruppiere nach Monat des Datums

# rendergrouptypes.year
source: Group by year of date
de: Gruppiere nach Jahr des Datums

# rendersortdirections.asc
source: Ascending
de: Aufsteigend

# rendersortdirections.desc
source: Descending
de: Absteigend

# deleteConfirm
source: Do you really want to delete definition ID %id%?
de: Soll die Definition ID %id% wirklich gelöscht werden?

# showRecord
source: Show the details of record %id%
de: Die Details des Datensatzes %id% anzeigen

# closeAll.label
source: Cancel
de: Abbrechen

# closeAll.description
source: Cancel multiple processing.
de: Mehrfachbearbeitung abbrechen
