Repository: MetaModels/core
Catalog: src/CoreBundle/Resources/translations/*_metamodel_dcasetting.*.xlf
Languages: de

# backend-module.headline
source: All input screen settings
de: Alle Einstellungen der Eingabemaske

# sorting.label
source: Sorting
de: Sortierung

# tstamp.label
source: Revision date
de: Aktualisierungsdatum

# published.label
source: Published
de: Veröffentlicht

# new.label
source: New attribute or legend
de: Neues Attribut oder Legende

# new.description
source: Add a new attribute or legend for input mask
de: Fügt ein neues Attribut oder eine Legende zur Eingabemaske hinzu

# all.label
source: Edit multiple
de: Mehrere bearbeiten

# all.description
source: Edit multiple elements at once
de: Mehrere Elemente auf einmal bearbeiten

# pastenew.label
source: Create a new element at the top
de: Ein neues Element oben erstellen

# pastenew.description
source: Create a new element after element ID %id%
de: Erstellt ein neues Element nach dem Element mit der ID %id%

# pasteafter.label
source: Paste at the top
de: Oben einfügen

# pasteafter.description
source: Paste after element ID %id%
de: Nach dem Element mit der ID %id% einfügen

# backBT
source: Go back
de: Zurück

# backBTTitle
source: Back to the previous page
de: Zurück zur vorherigen Seite navigieren

# editRecord
source: Edit record %id%
de: Datensatz bearbeiten %id%

source: Save
de: Speichern

# saveNclose
source: Save and close
de: Speichern und schliessen

# saveNcreate
source: Save and new
de: Speichern und Neu

# saveNback
source: Save and go back
de: Speichern und zurück

source: Continue
de: Fortfahren

source: Select all
de: Alles auswählen

# closeAll.label
source: Cancel
de: Abbrechen

# closeAll.description
source: Cancel multiple processing.
de: Mehrfachbearbeitung abbrechen

# dcatype.label
source: Type
de: Typ

# dcatype.description
source: Select the attribute type.
de: Den Attribut-Typ auswählen.

# attr_id.label
source: Attribute
de: Attribut

# attr_id.description
source: Attribute this setting relates to.
de: Attribut, auf das sich diese Einstellung bezieht.

# template.label
source: Custom template to use for generating
de: Angepasstes Template für die Ausgabe

# template.description
source: Select the template that shall be used for the selected attribute. Valid template files start with "mm_&lt;type&gt;" where the type name is put for &lt;type&gt;
de: Wählen Sie das Template aus, das für das gewählte Attribut verwendet werden soll. Gültige Dateinamen für das Template beginnen mit "mm_&lt;typ&gt;", wobei &lt;typ&gt; für den Typ steht.

# tl_class.label
source: Backend class
de: Backend-Klasse

# tl_class.description
source: Here you can set backend class(es). Open the wizard for an overview of the classes.
de: Hier können Sie eine oder mehrere Backend-Klassen festlegen.

# be_template.label
source: Template at backend
de: Template für das Backend

# be_template.description
source: You can chose own template for widget in backend - add file in root folder of template.
de: Sie können eine eigenes Template für das Widget im Backend auswählen - fügen Sie die Datei im Stammordner der Templates hinzu.

# legendhide.label
source: Collapse section
de: Abschnitt ausblenden

# legendhide.description
source: Collapse the section by default.
de: Abschnitt als Standardeinstellung ausblenden.

# legendtitle.label
source: Legend title
de: Legenden-Titel

# legendtitle.description
source: Here you can enter the legend title.
de: Hier können Sie den Legenden-Titel eingeben.

# name_langcode
source: Language
de: Sprache

# name_value
source: Legend title
de: Legenden-Titel

# mandatory.label
source: Mandatory
de: Pflichtfeld

# mandatory.description
source: Check if this attribute shall be mandatory. <br />NOTE: This will be implicitely active on if you selected "Unique values" in the attribute configuration.
de: Wählen Sie diese Option, wenn das Attribut ein Pflichtfeld ist. <br />Hinweis: Diese Option wird automatisch gesetzt, wenn in der Attributkonfiguration "Eindeutige Werte" ausgewählt wurde.

# alwaysSave.label
source: Always save
de: Immer speichern

# alwaysSave.description
source: If true the field will always be saved, even if its value has not changed.
de: Falls angewählt, wird dieses Feld - unabhängig davon, ob sich sein Wert geändert hat - immer gespeichert,

# chosen.description
source: Enable Chosen graphical select widget.
de: 'Chosen' für die Auswahl aktivieren.

# filterable.label
source: Filterable
de: Filterbar

# filterable.description
source: Check if this attribute shall be available for backend filtering.
de: Auswählen, falls dieses Attribut für die Filterung im Backend zur Verfügung stehen soll.

# searchable.label
source: Searchable
de: Suchbar

# searchable.description
source: Check if this attribute shall be available for backend search.
de: Auswählen, falls dieses Attribut für die Suche im Backend zur Verfügung stehen soll.

# allowHtml.label
source: Do not encode allowed html tags.
de: Erlaubte HTML-Tags nicht encodieren

# allowHtml.description
source: If you select this, allowed HTML tags from system settings will not be encoded.
de: Falls angewählt, werden die erlaubten HTML-Tags aus den Systemeinstellungen nicht encodiert.

# preserveTags.label
source: Do not encode all html tags.
de: Alle HTML-Tags nicht encodieren

# preserveTags.description
source: If you select this, no HTML tags will be encoded.
de: Falls angewählt, werden keine HTML-Tags encodiert.

# decodeEntities.label
source: Decode HTML entities.
de: HTML-Entitäten dekodieren.

# decodeEntities.description
source: If you select this, all HTML entities will be decoded. Note that HTML entities are always decoded if "Do not encode allowed html tags" is true.
de: Falls ausgewählt, werden alle HTML-Entitäten dekodiert. Beachten Sie, dass HTML-Entitäten immer dann decodiert werden, wenn "Erlaubte HTML-Tags nicht encodieren" aktiviert ist.

# rte.label
source: Enable richtext editor on this
de: Richtext-Editor aktivieren

# rte.description
source: Select the rich text configuration that shall be used on this field (if any).
de: Wählen Sie eine Voreinstellung für den Richtext-Editor aus, die für dieses Feld benutzt werden soll (falls vorhanden).

# rows.label
source: Rows
de: Zeilen

# rows.description
source: Amount of rows to use for longtext/table widget.
de: Anzahl der Zeilen, die für Longtext-/Table-Widget verwendet werden.

# cols.label
source: Columns
de: Spalten

# cols.description
source: Amount of colums to use for longtext/table widget
de: Anzahl der Spalten, die für Longtext-/Table-Widget verwendet werden.

# trailingSlash.label
source: Trailing slash handling
de: Führende '/' bearbeiten

# trailingSlash.description
source: Here you can specify how trailing slashes shall be handled
de: Hier können Sie angeben, wie führende '/' behandelt werden sollen.

# spaceToUnderscore.label
source: Replace spaces with underscore
de: Leerzeichen durch Unterstriche ersetzen

# spaceToUnderscore.description
source: If true any whitespace character will be replaced by an underscore.
de: Falls diese Option angewählt ist, werden Leerzeichen durch Unterstriche ersetzt.

# includeBlankOption.label
source: Include blank option
de: Leere Option einfügen

# includeBlankOption.description
source: if true a blank option will be added to the options which allows to define a &quot;no item selected&quot; option.
de: Falls diese Option angewählt ist, wird zusätzlich "kein Element ausgewählt" ermöglicht.

# readonly.label
source: Read only
de: Nur lesen

# readonly.description
source: If true a the widget will be read only and may not be changed.
de: Wenn aktiviert, erlaubt das Feld nur das Lesen und kann nicht geändert werden.

# submitOnChange.label
source: Submit on change
de: Absenden bei Änderungen

# submitOnChange.description
source: If active the form will be submitted when the field value changes.
de: Wenn aktiv, wird das Formular bei Änderungen eines Feldwertes abgesendet.

# title_legend
source: Type
de: Typ

# presentation_legend
source: Widget appearance related options
de: Anzeigeoptionen des Widgets

# functions_legend
source: Functionality related options
de: Funktionsbezogene Einstellungen

# overview_legend
source: Filtering and searching in the backend list
de: Filter und Suche in der Backend-Liste

# config_legend
source: Configuration
de: Einstellungen

# advanced_legend
source: Advanced
de: Erweitert

# edit.label
source: Edit setting
de: Einstellung bearbeiten

# edit.description
source: Edit the setting ID %id%
de: Bearbeite Einstellung ID %id%.

# cut.label
source: Cut setting definition
de: Einstellung ausschneiden

# cut.description
source: Cut the setting ID %id%
de: Ausschneiden der Einstellung ID %id%.

# copy.label
source: Copy setting definition
de: Kopiere Einstellung

# copy.description
source: Copy the setting ID %id%
de: Kopiere Einstellung ID %id%.

# delete.label
source: Delete setting
de: Lösche Einstellung

# delete.description
source: Delete the setting ID %id%
de: Lösche Einstellung ID %id%.

# delete.confirm
source: Do you really want to delete element ID %id%?
de: Soll das Element ID %id% wirklich gelöscht werden?

# conditions.label
source: Manage visibility conditions
de: Ansichtsbedingungen des Eingabefeldes

# conditions.description
source: Manage the visibility conditions of property ID %id%
de: Ansichtsbedingungen des Eingabefeldes ID %id%.

# show.label
source: Setting details
de: Einstellungsdetails

# show.description
source: Show details of setting ID %id%
de: Zeige Details der Einstellung ID %id%.

# toggle.label
source: Toggle
de: Wechseln

# toggle.description
source: Toggle the state of setting ID %id%
de: Wechseln des Status der Einstellung ID %id%.

# addall.label
source: Add all
de: Alle hinzufügen

# addall.description
source: Add all attributes to input screen
de: Alle Attribute der Eingabemaske hinzufügen.

# dcatypes.legend
source: Legend
de: Legende

# dcatypes.attribute
source: Attribute
de: Attribut

# trailingSlash_options.0
source: Strip slash on save
de: Schrägstrich beim Speichern entfernen

# trailingSlash_options.1
source: Add slash on save
de: Schrägstrich beim Speichern hinzufügen

# trailingSlash_options.2
source: Do nothing
de: Nichts tun

# addAll_willadd
source: Will add the attribute "%name%" [%type%, "%colName%"] to the input screen.
de: Fügt das Attribut "%name%" [%type%, "%colName%"] der Eingabemaske hinzu.

# addAll_alreadycontained
source: Attribute "%name%" [%type%, "%colName%"] is already contained in input screen.
de: Attribut "%name%" [%type%, "%colName%"] ist bereits in der Eingabemaske vorhanden.

# addAll_addsuccess
source: Added the attribute "%name%" [%type%, "%colName%"] to the input screen.
de: Fügt das Attribut "%name%" [%type%, "%colName%"] der Eingabemaske hinzu.

# addAll_activate
source: Add new settings enabled.
de: Hinzugefügte Einstellungen aktivieren.

# addAll_tlclass
source: Set backend class.
de: Backend-Klasse setzen

# mandatory_for_unique_attr
source: Unique attributes are automatically mandatory (this is not changable).
de: Eindeutige (unique) Attribute sind automatisch Pflichtfelder (Einstellung nicht änderbar).

# readonly_for_force_alias
source: Attributes with force alias are automatically readonly (this is not changable).
de: Attribute mit "Neuerstellung erzwingen" sind automatisch "nur lesend" (Einstellung nicht änderbar).

# readonly_for_always_save
source: Attributes with always save are automatically readonly (this is not changable).
de: Attribute mit "Immer speichern" sind automatisch "nur lesend" (Einstellung nicht änderbar).

# showRecord
source: Show the details of record %id%
de: Zeige Details Datensatz ID %id%.

# tl_class_headline
source: Set one or more of the following CSS classes to define the layout of the widget like "clr w50" - <a href="https://docs.contao.org/dev/reference/dca/palettes/#arranging-fields" target="_blank">see Contao manual</a>.
de: Legen Sie eine oder mehrere der folgenden CSS-Klassen fest, um das Layout des Widgets wie „clr w50“ zu definieren - <a href="https://docs.contao.org/dev/reference/dca/palettes/#arranging-fields" target="_blank">siehe Contao-Handbuch</a>.

# tl_class_w25.description
source: Set the field width to 25% and float it (float:left).
de: Setzen Sie die Breite des Feldes auf 25% und lassen Sie es floaten (float:left).

# tl_class_w33.description
source: Set the field width to 33.33333333% and float it (float:left).
de: Setzen Sie die Breite des Feldes auf 33.33333333% und lassen Sie es floaten (float:left).

# tl_class_w50.description
source: Set the field width to 50% and float it (float:left).
de: Setzen Sie die Breite des Feldes auf 50% und lassen Sie es floaten (float:left).

# tl_class_w66.description
source: Set the field width to 66.66666666% and float it (float:left).
de: Setzen Sie die Breite des Feldes auf 66.66666666% und lassen Sie es floaten (float:left).

# tl_class_w75.description
source: Set the field width to 75% and float it (float:left).
de: Setzen Sie die Breite des Feldes auf 75% und lassen Sie es floaten (float:left).

# tl_class_clr.description
source: Clear all floats (clear:both). Use this for any full length field coming after a w50 field within a fieldset (see note below).
de: Hebt alle float-Angaben auf (clear:both). Verwenden Sie dies für jedes Feld voller Länge, das nach einem w50-Feld innerhalb eines Feldsatzes kommt (siehe Hinweis unten).

# tl_class_wizard.description
source: Shorten the input field so there is enough room for the wizard button (e.g. date picker fields).
de: Kürzen Sie das Eingabefeld so, dass genügend Platz für das Wizard-Icon vorhanden ist (z. B. bei Datumsauswahlfeldern).

# tl_class_long.description
source: Make the input field full length.
de: Setzt das Eingabefeld auf die volle Länge.

# tl_class_cbx.description
source: Set the field minimum height to 46 pixels (used for single checkboxes; more space at bottom).
de: Setzen Sie die Mindesthöhe des Feldes auf 46 Pixel (für einzelne Kontrollkästchen; mehr Platz am unteren Rand).

# tl_class_m12.description
source: Adds a 17 pixels top and bottom padding to the element (used for single checkboxes; more space at top and bottom).
de: Fügt dem Element oben und unten eine Auffüllung von 17 Pixeln hinzu (wird für einzelne Kontrollkästchen verwendet; mehr Platz oben und unten).

# tl_class_cbx_m12.description
source: A combination of cbx and m12 sets the minimum height of the field to 80 pixels (used for single checkboxes; more space at top and bottom).
de: Eine Kombination aus cbx und m12 setzt die Mindesthöhe des Feldes auf 80 Pixel (für einzelne Ankreuzfelder; mehr Platz oben und unten).
