Repository: MetaModels/core
Catalog: src/CoreBundle/Resources/translations/*_metamodel.*.xlf
Languages: de, fr

# backend-module.headline
source: All MetaModels
de: Alle MetaModels
fr: Tous les MetaModels

# new.label
source: New MetaModel
de: Neues MetaModel
fr: Nouveau MetaModel

# new.description
source: Create a new MetaModel
de: Ein neues MetaModel erstellen
fr: Créer un nouveau MetaModel

# all.label
source: Edit multiple
de: Mehrere bearbeiten
fr: Édition multiple

# all.description
source: Edit multiple elements at once
de: Mehrere Elemente auf einmal bearbeiten
fr: Éditer plusieurs éléments en une fois

# pastenew.label
source: Create a new element at the top
de: Ein neues Element oben erstellen
fr: Créer un nouvel élément au dessus

# pastenew.description
source: Create a new element after element ID %id%
de: Erstellt ein neues Element nach dem Element mit der ID %id%
fr: Créer un nouvel élément après l'élément ID %id%

# pasteafter.label
source: Paste at the top
de: Oben einfügen
fr: Coller au dessus

# pasteafter.description
source: Paste after element ID %id%
de: Nach dem Element mit der ID %id% einfügen
fr: Coller après l'élément ID %id%

# backBT
source: Go back
de: Zurück
fr: Retour

# backBTTitle
source: Back to the previous page
de: Zurück zur vorherigen Seite navigieren
fr: Retour à la page précédente

# showRecord
source: Show the details of record %id%
de: Die Details des Datensatzes %id% anzeigen
fr: Afficher les détails de l'enregistrement %id%

# id.description
source: Id of the MetaModel
de: ID des MetaModels
fr: Id du MetaModel

# name.label
source: Name
fr: Nom

# name.description
source: MetaModel name.
de: Name des MetaModels.
fr: Nom du MetaModel

# tstamp.label
source: Revision date
de: Aktualisierungsdatum
fr: Date de modification

# tstamp.description
source: Date and time of the latest revision
de: Datum und Zeit der letzten Aktualisierung
fr: Date et heure de la dernière modification

# tableName.label
source: Table name
de: Tabellenname
fr: Nom de la table

# tableName.description
source: Name of database table to store items to.
de: Name der Datenbanktabelle, in der Datensätze gespeichert werden.
fr: Nom de la table de la base de donnée où stocker les items.

# mode.label
source: Parent list mode
de: Elternteil Liste Modus
fr: Mode de la liste parente

# mode.description
source: Mode to use for parent/child relationship.
de: Modus für Eltern / Kind-Beziehung verwenden.
fr: Mode à utiliser pour la relation parent/enfant

# translated.label
source: Translation
de: Übersetzung
fr: Traduction

# translated.description
source: Check if this MetaModel shall support translation/multilingualism.
de: Auswählen, falls das MetaModel Übersetzungen / Mehrsprachigkeit unterstützen soll-
fr: Cochez pour que ce MetaModel prenne en charge des traductions, le multilinguisme.

# languages.label
source: Languages to provide for translation
de: Sprachen für die Übersetzungen
fr: Langues pour la traduction

# languages.description
source: Specify all languages that shall be available for translation.
de: Alle Sprachen angeben, die für Übersetzungen zur Verfügung stehen sollen.
fr: Indiquez toutes les langues à ajouter pour les traductions

# languages_langcode.label
source: Language
de: Sprache
fr: Langue

# languages_langcode.description
source: Select the languages you want to provide.
de: Wählen Sie die Sprachen für die Übersetzungen aus.
fr: Sélectionnez les langues que vous souhaitez proposer.

# languages_isfallback.label
source: Fallback language
de: Fallback-Sprache
fr: Langue de secours

# languages_isfallback.description
source: Check the language that shall be used as fallback.
de: Wählen Sie die Sprache aus, die als Fallback verwendet werden soll, falls keine Übersetzung vorliegt.
fr: Cochez la langue à utiliser comme langue de secours (fallback)

# varsupport.label
source: Variant support
de: Varianten
fr: Gestion des variantes

# varsupport.description
source: Check if this MetaModel shall support variants of items.
de: Anwählen, falls dieses MetaModel Varianten der Items unterstützen soll.
fr: Cocher pour que ce Metamodel prenne en charge les variantes d'éléments.

# localeterritorysupport.label
source: Locale territory support
de: Support für Territory-Angabe in der Sprache
fr: Localisation territoriale

# localeterritorysupport.description
source: Check if this MetaModel shall support language territory at locale.
de: Mit der Checkbox wird die Territory-Angabe bei dem Sprachkey unterstützt.
fr: Cocher pour que ce MetaModel prenne en charge le territoire linguistique au niveau local.

# sorting.label
source: Sorting
de: Sortierung
fr: Tri

# sorting.description
source: Sorting order of items.
de: Sortierreihenfolge der Datensätze.
fr: Ordre de tri des éléments

# title_legend
source: Name and table
de: Name und Tabelle
fr: Nom et table

# translated_legend
source: Translation
de: Übersetzung
fr: Traduction

# advanced_legend
source: Advanced settings
de: Erweiterte Einstellungen
fr: Réglages avancés

# closeAll.label
source: Cancel
de: Abbrechen
fr: Annuler

# closeAll.description
source: Cancel multiple processing.
de: Mehrfachbearbeitung abbrechen
fr: Annuler plusieurs process

# edit.label
source: Manage items
de: Items verwalten
fr: Gérer les éléments

# edit.description
source: Manage items of MetaModel ID %id%
de: Die Items für MetaModel ID %id% verwalten
fr: Gérer les éléments du MetaModel IS %id%

# copy.label
source: Copy MetaModel definition
de: MetaModel-Definition kopieren
fr: Copier la définition du MetaModel

# copy.description
source: Copy definition of MetaModel ID %id%
de: Kopieren Sie die Definition des MetaModels ID %id%
fr: Copier la définition du MetaModel ID %id%

# delete.label
source: Delete MetaModel
de: MetaModel löschen
fr: Supprimer le MetaModel

# delete.description
source: Delete MetaModel ID %id%
de: Das MetaModel mit der ID %id% löschen.
fr: Supprimer le MetaModel ID %id%

# delete.confirm
source: Do you really want to delete element ID %id%?
de: Soll das Element ID %id% wirklich gelöscht werden?
fr: Voulez-vous vraiment supprimer l'élément ID %id% ?

# show.label
source: MetaModel details
fr: Détails du MetaModel

# show.description
source: Show details of MetaModel ID %id%
de: Die Details des MetaModel ID %id% anzeigen
fr: Afficher les détails du MetaModel ID %id%

# editheader.label
source: Edit MetaModel
de: MetaModel bearbeiten
fr: Éditer le MetaModel

# editheader.description
source: Edit the MetaModel ID %id%
de: Das MetaModel mit der ID %id% bearbeiten.
fr: Éditer le MetaModel ID %id%

# fields.label
source: Define attributes
de: Attribute definieren
fr: Définir les attributs

# fields.description
source: Define attributes for MetaModel ID %id%
de: Die Attribute für MetaModel ID %id% festlegen
fr: Définir les attributs du MetaModel ID %id%

# filter.label
source: Define filters
de: Filter definieren
fr: Définir les filtres

# filter.description
source: Define filters for MetaModel ID %id%
de: Die Filter für MetaModel ID %id% festlegen
fr: Définir les filtres du MetaModel ID %id%

# rendersettings.label
source: Define render settings
de: Render-Einstellungen definieren
fr: Définir les paramètres de rendu

# rendersettings.description
source: Define render settings for MetaModel ID %id%
de: Render-Einstellungen für MetaModel ID %id% definieren.
fr: Définir les paramètres de rendu du MetaModel ID %id%

# dca.label
source: Define input screens
de: Eingabemasken definieren
fr: Définir les écrans de saisie

# dca.description
source: Define input screens for MetaModel ID %id%
de: Die Eingabemasken für MetaModel ID %id% festlegen
fr: Définir les écrans de saisie du MetaModel ID%id%

# dca_combine.label
source: Define input/output combinations
de: Eingabe-/Render-Zuordnungen definieren
fr: Définir les combinaisons d'entrée/sortie

# dca_combine.description
source: Define input/output combinations for MetaModel ID %id%
de: Definieren der Eingabe-/Render-Zuordnungen für MetaModel ID %id%.
fr: Définir les combinaisons d'entrée/sortie pour le MetaModel ID %id%

# cut.label
source: Move MetaModel
de: MetaModel verschieben
fr: Déplacer le MetaModel

# cut.description
source: Define the order of your MetaModels.
de: Die Reihenfolge der MetaModels festlegen.
fr: Modifier l'ordre de vos MetaModels

# searchable_pages.label
source: Define search settings
de: Sucheinstellungen festlegen
fr: Définir les paramètres de recherche

# searchable_pages.description
source: Define search settings for MetaModel ID %id%
de: Die Sucheinstellungen für MetaModel ID %id% festlegen
fr: Définir les paramètres de recherche du MetaModel ID %id%

# itemFormatCount.label
source: {-1} Table does not exist, run migration!| {0} No items|{1} 1 item|[2,Inf[ %count% items
de: {-1} Tabelle existiert nicht - Migration ausführen!| {0} Keine Items|{1} 1 Item|[2,Inf[ %count% Items
fr: {-1} La table n'existe pas, exécutez la migration !| {0} Aucun élément|{1} 1 élément|[2,Inf[ %count% éléments

# deleteConfirm
source: Do you really want to delete MetaModel ID %id%?
de: Soll das MetaModel ID %id% wirklich gelöscht werden?
fr: Voulez-vous vraiment supprmer le MetaModel ID %id% ?

# hint_schema_manager
source: After creating a model, the database must be migrated (console, Contao Manager) - even if the table name is changed. When changing the table name, the user data itself must be transferred.
de: Nach der Erstellung eines Modells muss die Datenbank migriert werden (Konsole, Contao Manager) - auch wenn der Tabellenname geändert wird. Bei der Änderung des Tabellennamens müssen die Daten selbst übertragen werden.
fr: Après la création d'un modèle, la base de données doit être migrée (console, Contao Manager) - même si le nom de la table est modifié. En cas de changement du nom de la table, les données utilisateur elles-mêmes doivent être transférées.

# newRecord
source: Create a new item
de: Neues Item erstellen
fr: Créer un nouvel élément

# editRecord
source: Edit record %id%
de: Bearbeite Datensatz %id%
fr: Modifier l'enregistrement %id%

source: Save
de: Speichern
fr: Enregistrer

# saveNclose
source: Save and close
de: Speichern und schliessen
fr: Enregistrer et fermer

# saveNcreate
source: Save and new
de: Speichern und neu
fr: Enregistrer et nouveau

# saveNback
source: Save and go back
de: Speichern und zurück
fr: Enregistrer et retour

# ERR.tableNameNotGiven
source: The table name is not given or empty.
de: Der Tabellenname wurde nicht gesetzt oder ist leer.
fr: Le nom de la table n'est pas autorisé ou est vide.

# ERR.invalidTableName
source: The table name "%table_name%" is invalid.
de: Der Tabellenname "%col_name%" ist ungültig.
fr: Le nom de la table "%table_name%" n'est pas valide.

# ERR.tableExists
source: Table "%table_name%" already exists.
de: Die Tabelle "%table_name%" existiert bereits.
fr: La table "%table_name%" existe déjà.
