Repository: MetaModels/core
Catalog: src/CoreBundle/Resources/translations/*_metamodel_dcasetting_condition.*.xlf
Languages: de

# backend-module.headline
source: All input screen conditions
de: Alle Ansichtsbedingungen

# sorting.label
source: Sorting
de: Sortierung

# tstamp.label
source: Revision date
de: Aktualisierungsdatum

# new.label
source: New condition
de: Neue Bedingung

# new.description
source: Add a new visibility condition
de: Eine neue Bdingung zur Sichtbarkeit hinzufügen

# all.label
source: Edit multiple
de: Mehrere bearbeiten

# all.description
source: Edit multiple elements at once
de: Mehrere Elemente auf einmal bearbeiten

# backBT
source: Go back
de: Zurück

# backBTTitle
source: Back to the previous page
de: Zurück zur vorherigen Seite navigieren

# list_label.label
source: Visibility conditons
de: Sichtbarkeits-Bedingungen

# basic_legend
source: Basic configuration
de: Grundkonfiguration

# config_legend
source: Condition configuration
de: Konfiguration der Bedingung

# type.label
source: Type
de: Typ

# type.description
source: Select the condition type.
de: Wählen Sie einen Bedingungstyp aus. Weitere Informationen erhalten Sie über den Hilfe-Assistenten.

# enabled.label
source: Enabled
de: Aktiviert

# enabled.description
source: Check to enable this condition.
de: Auswählen um die Bedingung zu aktivieren.

# comment.label
source: Comment
de: Kommentar

# comment.description
source: Enter a comment to describe the purpose of this condition.
de: Ein kurzer Kommentar, der den Zweck dieser Bedingung beschreibt.

# attr_id.label
source: Attribute
de: Attibut

# attr_id.description
source: Select the attribute to use for this condition.
de: Das Attribut auswählen, das in dieser Bedingung verwendet werden soll.

# value.label
source: Value
de: Wert

# value.description
source: Please select the desired value.
de: Bitte wählen Sie einen eigenen Wert aus.

# edit.label
source: Edit setting
de: Einstellung bearbeiten

# edit.description
source: Edit the setting ID %id%
de: Bearbeiten Sie die Einstellungen ID %id%.

# cut.label
source: Cut setting definition
de: Einstellung ausschneiden

# cut.description
source: Cut the setting ID %id%
de: Ausschneiden der Einstellung ID %id%.

# copy.label
source: Copy setting definition
de: Einstellung kopieren

# copy.description
source: Copy the setting ID %id%
de: Kopieren Sie die Einstellung ID %id%.

# delete.label
source: Delete setting
de: Einstellung löschen

# delete.description
source: Delete the setting ID %id%
de: Löschen Sie die Einstellung ID %id%.

# delete.confirm
source: Do you really want to delete element ID %id%?
de: Soll das Element ID %id% wirklich gelöscht werden?

# conditions.label
source: Manage conditions
de: Bedingungen verwalten

# conditions.description
source: Manage the conditions of property ID %id%
de: Verwalten Sie die Bedingungen der Eigenschaft ID %id%.

# show.label
source: Setting details
de: Einstellungsdetails

# show.description
source: Show details of setting ID %id%
de: Zeige Details der Einstellung ID %id%.

# toggle.label
source: Toggle
de: Wechseln

# toggle.description
source: Toggle the state of setting ID %id%
de: Wechseln des Status der Einstellung ID %id%

# addall.label
source: Add all
de: Alle hinzufügen

# addall.description
source: Add all attributes to input screen
de: Alle Attribute der Eingabemaske hinzufügen

# pastenew.label
source: Add new at the top
de: Neue Einstellung oben erstellen.

# pastenew.description
source: Add new after setting ID %id%
de: Neues Einstellung nach dem Element ID %id% erstellen.

# pasteafter.label
source: Create new after setting ID %id%
de: Neue Einstellung nach Element ID %id% anlegen.

# pasteafter.description
source: Create new after setting ID %id%
de: Neue Einstellung nach Element ID %id% anlegen.

# pasteinto.label
source: Create new setting at the top
de: Neue Einstellung oben anlegen.

# pasteinto.description
source: Create new at the top of setting ID %id%
de: Neue Einstellung oberhalb von Einstellung ID %id% anlegen.

# conditionnames.conditionpropertyvalueis
source: Attribute value is...
de: Eigenschaftswert ist...

# conditionnames.conditionpropertycontainanyof
source: Attribute values contain any of...
de: Eigenschaftswert kann beinhalten ...

# conditionnames.conditionpropertyvisible
source: Is attribute visible...
de: Eigenschaft ist sichtbar ...

# conditionnames.conditionor
source: OR
de: ODER

# conditionnames.conditionand
source: AND
de: UND

# conditionnames.conditionnot
source: NOT
de: NICHT

# typedesc._default_
source: %icon% <strong>%name%</strong> - for attribute "%attribute%" (Parameter: "%value%")%comment%
de: %icon% <strong>%name%</strong> - für Attribut "<em>%attribute%</em>" (Parameter: "%value%")%comment%

# typedesc.conditionor
source: %icon% <strong>%name%</strong> - any sub conditions must be fulfilled%comment%
de: %icon% <strong>%name%</strong> - eine beliebige Bedingung muss erfüllt sein. %comment%

# typedesc.conditionand
source: %icon% <strong>%name%</strong> - all sub conditions must be fulfilled%comment%
de: %icon% <strong>%name%</strong> - alle Bedingungen müssen erfüllt sein. %comment%

# typedesc.conditionnot
source: %icon% <strong>%name%</strong> - invert the result of the contained condition%comment%
de: %icon% <strong>%name%</strong> - kehrt das Ergebnis der vorgegebenen Bedingung um. %comment%

# typedesc.conditionpropertyvalueis
source: %icon% <strong>%name%</strong> - for attribute "%attribute%" (Parameter: "%value%")%comment%
de: %icon% <strong>%name%</strong> - für Attribut "<em>%attribute%</em>" (Parameter: "%value%")%comment%

# typedesc.conditionpropertycontainanyof
source: %icon% <strong>%name%</strong> - for attribute "%attribute%" (Parameter(s): "%value%")%comment%
de: %icon% <strong>%name%</strong> - für Attribut "<em>%attribute%</em>" (Parameter: "%value%")%comment%

# typedesc.conditionpropertyvisible
source: %icon% <strong>%name%</strong> - for attribute or legend "%attribute%"%comment%
de: %icon% <strong>%name%</strong> - für Attribut oder Legende "%attribute%"%comment%

# deleteConfirm
source: Do you really want to delete setting ID %id%?
de: Möchten Sie die Einstellung mit der ID %id% wirklich löschen?

# showRecord
source: Show the details of record %id%
de: Die Details des Datensatzes %id% anzeigen

# type_value_is.caption
source: Attribute value is...
de: Eigenschaftswert ist gleich ...

# type_value_is.description
source: The condition is fulfilled when the attribute value is equal to the specified value..
de: Die Bedingung ist erfüllt, wenn der Attributwert gleich dem festgelegten Wert ist. Als Attribute können diejenigen mit Einfachauswahl wie z.B. Select oder Checkbox ausgewählt werden.

# type_values_contain.caption
source: Attribute values contain any of...
de: Eigenschaftswert beinhaltet ...

# type_values_contain.description
source: The condition is fulfilled when any of the attribute's values matches at least one of the specified values (set intersection).
de: Die Bedingung ist erfüllt, wenn ein beliebiger Attributwert gleich dem jeweils festgelegten Wert ist (Schnittmenge bzw. ODER). Als Attribute können diejenigen mit Mehrfachauswahl wie z.B. Tags ausgewählt werden.

# type_is_visible.caption
source: Is attribute visible...
de: Eigenschaft ist sichtbar ...

# type_is_visible.description
source: The condition is fulfilled when the condition of the specified attribute is fulfilled. In other words, the attribute is visible if, and only if, the specified attribute is visible as well.
de: Die Bedingung ist erfüllt, wenn alle Bedingungen für ein ausgewähltes Attribut erfüllt sind. Mit anderen Worten, das Attribut ist sichtbar, und nur dann, wenn das ausgewählte (oder "referenzierte") Attribut auch sichtbar ist. Mit diesem Bedingungstyp erspart man sich das Duplizieren von erstellten Ansichtsbedingungen eines Attributs.

# type_or.caption
source: OR
de: ODER

# type_or.description
source: Any sub condition must be fulfilled.
de: Eine beliebige Bedingung muss erfüllt sein.

# type_and.caption
source: AND
de: UND

# type_and.description
source: All sub condition must be fulfilled.
de: Alle Bedingungen müssen erfüllt sein.

# type_not.caption
source: NOT
de: NICHT

# type_not.description
source: Invert the result of the contained condition.
de: Kehrt das Ergebnis einer vorgegebenen Bedingung um.
