Repository: MetaModels/core
Catalog: src/CoreBundle/Resources/translations/metamodels_navigation.*.xlf
Languages: de

# menu.metamodels.title
source: The MetaModels extension allows you to create own data models.
de: Die MetaModels-Erweiterung ermöglicht es Ihnen, eigene Datenmodelle zu erstellen.

# metamodel_attribute
source: Attributes of "%s"
de: Attribute von "%s"

# metamodel_rendersettings
source: All render setting of "%s"
de: Alle Render-Einstellungen von "%s"

# metamodel_rendersetting
source: Render settings in "%s"
de: Render-Einstellungen in "%s"

# metamodel_dca_sortgroup
source: Sorting and grouping in "%s"
de: Sortierung und Gruppierung in "%s"

# metamodel_dca
source: All input screens of "%s"
de: Alle Eingabemasken von "%s"

# metamodel_dcasetting
source: Input screens in "%s"
de: Eingabemasken in "%s"

# metamodel_dca_combine
source: Input screen and render setting combination for "%s"
de: Eingabemaske und Render-Einstellung kombinieren für "%s"

# metamodel_dcasetting_condition
source: Visibility conditions for attribute "%s"
de: Ansichtsbedingungen für Attribut "%s"

# metamodel_filter
source: All filter of "%s"
de: Alle Filter von "%s"

# metamodel_filtersetting
source: Filter settings in "%s"
de: Filtereinstellungen in "%s"

# metamodel_searchable_pages
source: All indexes of "%s"
de: Alle Indizes von "%s"
