Repository: MetaModels/core
Catalog: src/CoreBundle/Resources/translations/metamodels_support.*.xlf
Languages: de

# menu.label
source: Support MetaModels
de: MetaModels unterstützen

# menu.description
source: Support information for the MetaModels extension.
de: Informieren Sie sich darüber, wie Sie die Entwicklung der MetaModels-Extension unterstützen können.

# main_text
source: As the developers of this project, we receive no compensation for our work. Much of our valuable time is freely given to the MetaModels project. Any donations towards the MetaModels project would allow us to work on the project during our working hours, speeding up development significantly. <br /><br /> We guarantee to spend any donations only on this project. If you have any specific requirements or features requests, you are free to hire a member from our <a target="_blank" href="https://now.metamodel.me/en/about/team">team</a>, who will gladly help you.<br /><br />A big thanks to all our <a target="_blank" href="https://now.metamodel.me/en/supporters">existing supporters and sponsors</a>. Please consider joining our list of sponsors. We could not create such a popular open source project without the support of the community.<br /><br /><a target="_blank" href="https://now.metamodel.me/en/supporters/donate">More informations</a>
de: Als Entwickler dieses Projektes erhalten wir keine Vergütung für unsere Arbeit. Ein Großteil unserer wertvollen Zeit widmen wir dem MetaModels-Projekt. Jede Spende an das MetaModels-Projekt würde es uns ermöglichen, während unserer regulären Arbeitszeit an dem Projekt zu arbeiten, was die Entwicklung erheblich beschleunigen würde. Deshalb bitten wir um eine Unterstützung für das MetaModels-Projekt. <br /><br /> Wir garantieren, dass Spendengelder nur für dieses Projekt ausgegeben werden. Sollten Sie spezielle Wünsche oder Anforderungen haben, können Sie gerne ein Mitglied unseres <a target="_blank" href="https://now.metamodel.me/de/ueber-uns/team">Teams</a>, anfragen, das Ihnen gerne weiterhilft. <br /><br />Ein großes Dankeschön an alle <a target="_blank" href="https://now.metamodel.me/de/unterstuetzung">bestehenden Supporter und Sponsoren</a>. Bitte beachten Sie unsere Spendenseite. Ein solches umfangreiches Open Source Projekt konnten wir ohne die Unterstützung der Community nicht realisieren.<br /><br /><a target="_blank" href="https://now.metamodel.me/de/unterstuetzer/spenden">Mehr Infos</a>

# main_headline
source: We are calling for your help!
de: Bitte unterstützen Sie uns!

# contributor_headline
source: Thanks to these users for tickets, suggestions and translations
de: Wir danken diesen Benutzerinnen und Benutzern für Tickets, Anregungen und Übersetzungen:

source: Purpose
de: Verwendungszweck

# other_donations
source: For donations check also our <a target="_blank" href="https://now.metamodel.me/en/supporters/fundraising"> fundraisings</a> or consider <a target="_blank" href="https://now.metamodel.me/en/supporters/donate"> donating for the manual</a>.
de: Für Spenden besuchen Sie auch unsere <a target="_blank" href="https://now.metamodel.me/de/unterstuetzer/fundraising">Fundraisings</a> oder beachten Sie <a target="_blank" href="https://now.metamodel.me/de/unterstuetzer/spenden">Spenden für das Handbuch</a>.

# help_headline
source: Help for your MetaModels projects
de: Hilfe für Dein MetaModels Projekt

# help_text
source: On our <a target="_blank" href="https://now.metamodel.me/en/help">help website as guide to MetaModels</a> you can find the manual, all support channels, videos tutorials and our newsletter service.<br /><br /> <a target="_blank" href="https://metamodels.readthedocs.io/en/latest/"> Direct link to the MetaModels manual...</a>
de: Auf unserer <a target="_blank" href="https://now.metamodel.me/de/hilfe">Hilfe-Website</a> finden Sie als Leitfaden zu MetaModels das Handbuch, alle Support-Kanäle, Videos und unseren Newsletter-Service.<br /><br /><a target="_blank" href="https://metamodels.readthedocs.io/de/latest/">Direkter Link zum MetaModels Handbuch...</a>

# contributor_link
source: See contributors at github...
de: Mitwirkende bei Github...
